avr-rust/avrd/packs/tiny/ATtiny48.atdf
<?xml version="1.0" encoding="UTF-8"?>
<avr-tools-device-file xmlns:xalan="http://xml.apache.org/xalan" xmlns:NumHelper="NumHelper" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATtiny48-MMU" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="QFN28"   pinout="QFN28"/>
    <variant ordercode="ATtiny48-MMH" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="QFN28"   pinout="QFN28"/>
    <variant ordercode="ATtiny48-PU"  speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="PDIP28"  pinout="PDIP"/>
    <variant ordercode="ATtiny48-AU"  speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="TQFP32"  pinout="TQFP32_QFN32"/>
    <variant ordercode="ATtiny48-CCU" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="UFBGA32" pinout="UFBGA"/>
    <variant ordercode="ATtiny48-MU"  speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="QFN32"   pinout="TQFP32_QFN32"/>
  </variants>
  <devices>
    <device name="ATtiny48" architecture="AVR8" family="tinyAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x1000">
          <memory-segment start="0x0000" size="0x1000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x40"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
          <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0200">
          <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
          <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
          <memory-segment name="IRAM" start="0x0100" size="0x0100" type="ram" external="false"/>
        </address-space>
        <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0040">
          <memory-segment start="0x0000" size="0x0040" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x04"/>
        </address-space>
        <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
        <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
          <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="TC16">
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="T" pad="PD5"/>
              <signal group="ICP" pad="PB0"/>
              <signal group="OCA" pad="PB1"/>
              <signal group="OCB" pad="PB3"/>
            </signals>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal group="AIN" index="0" pad="PD6"/>
              <signal group="AIN" index="1" pad="PD7"/>
            </signals>
          </instance>
        </module>
        <module name="PORT">
          <instance name="PORTB" caption="I/O Port">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PB0" index="0"/>
              <signal group="P" function="default" pad="PB1" index="1"/>
              <signal group="P" function="default" pad="PB2" index="2"/>
              <signal group="P" function="default" pad="PB3" index="3"/>
              <signal group="P" function="default" pad="PB4" index="4"/>
              <signal group="P" function="default" pad="PB5" index="5"/>
              <signal group="P" function="default" pad="PB6" index="6"/>
              <signal group="P" function="default" pad="PB7" index="7"/>
            </signals>
          </instance>
          <instance name="PORTD" caption="I/O Port">
            <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PD0" index="0"/>
              <signal group="P" function="default" pad="PD1" index="1"/>
              <signal group="P" function="default" pad="PD2" index="2"/>
              <signal group="P" function="default" pad="PD3" index="3"/>
              <signal group="P" function="default" pad="PD4" index="4"/>
              <signal group="P" function="default" pad="PD5" index="5"/>
              <signal group="P" function="default" pad="PD6" index="6"/>
              <signal group="P" function="default" pad="PD7" index="7"/>
            </signals>
          </instance>
          <instance name="PORTC" caption="I/O Port">
            <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PC0" index="0"/>
              <signal group="P" function="default" pad="PC1" index="1"/>
              <signal group="P" function="default" pad="PC2" index="2"/>
              <signal group="P" function="default" pad="PC3" index="3"/>
              <signal group="P" function="default" pad="PC4" index="4"/>
              <signal group="P" function="default" pad="PC5" index="5"/>
              <signal group="P" function="default" pad="PC6" index="6"/>
              <signal group="P" function="default" pad="PC7" index="7"/>
            </signals>
         </instance>
          <instance name="PORTA" caption="I/O Port">
            <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PA0" index="0"/>
              <signal group="P" function="default" pad="PA1" index="1"/>
              <signal group="P" function="default" pad="PA2" index="2"/>
              <signal group="P" function="default" pad="PA3" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="SPI">
          <instance name="SPI" caption="Serial Peripheral Interface">
            <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
            <signals>
              <signal group="SCK" pad="PB5"/>
              <signal group="MISO" pad="PB4"/>
              <signal group="MOSI" pad="PB3"/>
              <signal group="SS" pad="PB2"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT" caption="Watchdog Timer">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
