avr-rust/avrd/packs/tiny/ATtiny48.atdf
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="BOD Sleep" mask="0x40" name="BODS"/>
          <bitfield caption="BOD Sleep Enable" mask="0x20" name="BODSE"/>
          <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode" mask="0x06" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
        <register caption="Port Configuration Register" name="PORTCR" offset="0x32" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x80" name="BBMD"/>
          <bitfield caption="" mask="0x40" name="BBMC"/>
          <bitfield caption="" mask="0x20" name="BBMB"/>
          <bitfield caption="" mask="0x10" name="BBMA"/>
          <bitfield caption="" mask="0x08" name="PUDD"/>
          <bitfield caption="" mask="0x04" name="PUDC"/>
          <bitfield caption="" mask="0x02" name="PUDB"/>
          <bitfield caption="" mask="0x01" name="PUDA"/>
        </register>
      </register-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Reserved" name="VAL_0x06" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2"/>
        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
      </parameters>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWHSR" name="TWHSR" offset="0xBE" size="1">
          <bitfield caption="" mask="0x01" name="TWHS"/>
        </register>
        <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
          <bitfield caption="" mask="0xFE" name="TWAM"/>
        </register>
        <register caption="TWI Bit Rate register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
        <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0xBA" size="1">
          <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_TWI_PRESACLE">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="4" name="VAL_0x01" value="0x01"/>
        <value caption="16" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
          <bitfield caption="Reference Selection Bit 0" mask="0x40" name="REFS0" values="ANALOG_ADC_V_REF7"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x0F" name="MUX"/>
        </register>
