avr-rust/avrd/packs/tiny/ATtiny48.atdf
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="The ADC Control and Status register A" name="ADCSRA" offset="0x7A" size="1">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC  Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="The ADC Control and Status register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="" mask="0x40" name="ACME"/>
          <bitfield caption="ADC Auto Trigger Source bits" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="" mask="0x02" name="AIN1D"/>
          <bitfield caption="" mask="0x01" name="AIN0D"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="" mask="0x80" name="ADC7D"/>
          <bitfield caption="" mask="0x40" name="ADC6D"/>
          <bitfield caption="" mask="0x20" name="ADC5D"/>
          <bitfield caption="" mask="0x10" name="ADC4D"/>
          <bitfield caption="" mask="0x08" name="ADC3D"/>
          <bitfield caption="" mask="0x04" name="ADC2D"/>
          <bitfield caption="" mask="0x02" name="ADC1D"/>
          <bitfield caption="" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF7">
        <value caption="Internal 1.1V Voltage Reference" name="VAL_0x00" value="0x00"/>
        <value caption="AVcc Reference" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL2"/>
          <bitfield caption="External Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request 1 Enable" mask="0x03" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0x03" name="INTF"/>
        </register>
        <register caption="" name="PCICR" offset="0x68" size="1">
          <bitfield caption="" mask="0x0F" name="PCIE"/>
        </register>
        <register caption="Pin Change Mask Register 3" name="PCMSK3" offset="0x6A" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0x0F" name="PCINT" lsb="24"/>
        </register>
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="16"/>
        </register>
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="8"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
        </register>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
          <bitfield caption="Pin Change Interrupt Flags" mask="0x0F" name="PCIF"/>
        </register>
      </register-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
        <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x45" size="1">
          <bitfield caption="Clear Timer on Compare Match" mask="0x08" name="CTC0"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
